[
    {
        "job_id": 1,
        "company_name": "Keppel Corporation Limited",
        "job_title": "Group internal Audit, Analytics and Automation",
        "date": "Singapore, Jan2022 - Jun2022",
        "job_desc": "• Liaised with auditors to develop and manage big data pipelines using necessary ETL procedures and deployed the relevant processes for continuous assessment using dynamic PowerBI dashboards.\n                •Spearheaded projects in different areas such as using graphical analysis to determine underlying relationships between Chinese companies and analyzing risk faced by the organization due to the sanctions imposed.\n                •Improved efficiency by reducing time taken to process by almost 1/4th of original time taken.\n                •Skills: Cypher Query Language · Gremlin Query Language · Invoice Processing · Azure Cosmos DB · Azure Databricks · PySpark · Microsoft Power BI",
        "image_path": "./images/Keppel-logo.png"
    },
    {
        "job_id": 2,
        "company_name": "Ubisoft",
        "job_title": "Data Science Intern",
        "date": "Singapore, Oct2022 - Present",
        "job_desc": "Exploring to represent game data as a knowledge Graph.",
        "image_path": "./images/ubisoft-logo.jpeg"
    },
    {
        "job_id": 3,
        "company_name": "Ubisoft",
        "job_title": "Software Engineer (Machine learning) Intern",
        "date": "Singapore, Jul2022 - Sep2022",
        "job_desc": "• Developed a web application to extract game credits from videos.\n        • Processed image frames using openCV and extracted text using optical character recognition, easyOCR. \n        • Implemented k-means clustering and other techniques to map respective job titles with the names of people.\n        • Designied an interactive user-interface using ReactJS to upload videos and extract game credits as well as filter data based on search parameters. \n\n        • Frontend Framework – ReactJS, Backend Framework – Flask, Database – MongoDB.",
        "image_path": "./images/ubisoft-logo.jpeg"
    },
    {
        "job_id": 4,
        "company_name": "A*Star",
        "job_title": "Research Intern",
        "date": "Singapore, May2022 - Jul2022",
        "job_desc": "• Ascertained novel ways of pruning neural networks to make them more compact.\n        • Analyzed pruning rules like global pruning to achieve state-of-the-art performance.\n        • Conducted research experiments on CIFAR10 and ImageNet datasets to validate new pruning rules.\n        • Developed and analyzed changes made to existing algorithms to push state-of-the-art further for sparsity and accuracy achieved after pruning.\n        ",
        "image_path": "./images/Astar-logo.jpeg"
    }
]